{"pageProps":{"postData":{"id":"hosting-next-js-site-github-pages","contentHtml":"<p>hey y'all, as you all may know, github has a service called pages, which allows you to host static files for free. this post will will go over how to setup a continuous integration workflow to deploy a blog to pages.</p>\n<h1>terms</h1>\n<ul>\n<li>\n<p><strong><a href=\"https://pages.github.com\">github pages</a></strong></p>\n<ul>\n<li>a service that allows you to pick a particular branch and subdirectory of a git repository to use as a static hosting directory. it is a very handy service for creating small single page apps which run entirely on the browser.</li>\n</ul>\n</li>\n<li>\n<p><strong><a href=\"https://nextjs.org\">next.js</a></strong></p>\n<ul>\n<li>a jam stack implementation based off react which provides many goodies for single-page front-end applications. i picked it because of it's ability to render markdown easily with a lightweight setup. this tutorial wont go too deep into next.js (as i admittedly don't know that much) and will only show what is necessary to get a next.js app working on github pages.</li>\n</ul>\n</li>\n<li>\n<p><strong><a href=\"https://github.com/features/actions\">github actions</a></strong></p>\n<ul>\n<li>introduced in nov 2019, it allows you to program automated workflows based on events that happen within your git repository. these workflows are concisely defined within yaml files which is added to your repository. we will see an example of one of these such yamls.</li>\n</ul>\n</li>\n</ul>\n<h1>setting up the repo</h1>\n<p>in order to get a starter next.js app you can follow <a href=\"https://nextjs.org/learn/basics/create-nextjs-app\">this guide</a>. this will give you a good introduction to next.js and its capabilities, as well as provide you with something to deploy. i will be using a site that has been filled out by following this guide up through the <em>dynamic routes</em> section, yet the steps will be the same for any next.js app.</p>\n<p>once you have gone through this tutorial you should be left with a git repo containing your new app. also, if you haven't already, make sure to setup your github account with ssh key access by following the guide <a href=\"https://docs.github.com/en/free-pro-team@latest/github/authenticating-to-github/connecting-to-github-with-ssh\">here</a>. this will help smooth out the authentication step when pushing your git repo so you don't have to type your password every time. in order to push my blog i executed the following commands:</p>\n<pre><code class=\"language-bash\">    $ git remote add origin git@github.com:lagooned/blog.git\n    $ git push origin HEAD\n</code></pre>\n<p>this will push code to the default branch on your repository. when visiting <a href=\"https://github.com/lagooned/blog\">the repository</a> on github, you should see your entire root directory and the readme rendered.</p>\n<h1>creating the workflow</h1>\n<p>great, now we've pushed the code to our repository, we need to setup a workflow which will deploy it. we do this by creating a workflow yaml file. these are placed under the root directory of the repository in the .github/workflow directory. you can create this file like so:</p>\n<pre><code class=\"language-bash\">    $ touch .github/workflows/node.js.yaml\n</code></pre>\n<p>this file is called <em>node.js.yaml</em> because the build tool we will be using is npm (node package manager), which hopefully you have some experience with by now after the next.js tutorial. </p>\n<p><a href=\"https://github.com/lagooned/blog/blob/main/.github/workflows/node.js.yml\">here</a> is the contents of the workflow. this file defines upon a push to a particular branch, in this case <strong>main</strong>, execute this workflow. in looking closer at the yaml, this workflow is a build process which executes on the latest version of ubuntu (hence ubuntu-latest), and requires the latest version of node.js 12 (hence 12.x). this workflow also is comprised of many jobs which run in order. in looking at the <strong>steps</strong> section of the configuration, we find these steps:</p>\n<pre><code class=\"language-yaml\">    steps:\n    - name: checkout\n    ...\n    - name: require node ${{ matrix.node-version }}\n    ...\n    - name: install deps\n    ...\n    - name: build static pages\n    ...\n    - name: deploy to gh-pages\n    ...\n</code></pre>\n<p>these are the main steps of our workflow. first we checkout our repo from github; then pull in our build tool runtime, <strong>node.js</strong>, as well as our build tool, <strong>npm</strong>; subsequently install the dependencies defined with in our project manifest (aka the package.json and package-lock.json); export our next.js app to a bundle of static resources; and finally deploy our static resources to github pages.</p>\n<p>the final step requires the setup of a <a href=\"https://docs.github.com/en/free-pro-team@latest/github/authenticating-to-github/creating-a-personal-access-token\">personal access token</a> with the following permissions:</p>\n<ul>\n<li>repo:status</li>\n<li>repo_deployment</li>\n<li>public_repo</li>\n<li>repo:invite</li>\n</ul>\n<p>add this token's value to your repository as a secret with the id <strong>ACTIONS_DEPLOY_ACCESS_TOKEN</strong> (as referred in the yaml via the *secrets.** namespace). this token will allow the workflow to push to the gh-pages branch of your repository.</p>\n<p>add this yaml to your repository but don't push just yet, there are still some things we have to do to the project:</p>\n<pre><code class=\"language-bash\">    $ git add .github/workflow/node.js.yaml\n    $ git commit -m \"added node.js.yaml actions workflow\"\n</code></pre>\n<p>this post, as with everything i do, will be an agile<sup>tm</sup> work in progress, so please check back for more updates.</p>\n<p>-jared</p>\n","title":"hosting next.js sites on github pages with github actions","date":"2020-12-22"}},"__N_SSG":true}